testing/Replication.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">500</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <longProp name="ThreadGroup.duration">900</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <stringProp name="HTTPSampler.path">/user/search</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="first_name" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${__V(${__chooseRandom(Кар,Кир,Диа,Юри,Фил,Дем,Яко,Гле,Зла,Ром,Яро,Юли,Вар,Анн,Анг,Алё,Мир,Дми,Ник,Оль,Гри,Нат,Вер,Тих,Лук,Пла,Мар,Мил,Вал,Ста,Сав,Мак,Арт,Гер,Анд,Ека,Мих,Лев,Нин,Ева,Зоя,Род,Фёд,Вик,Соф,Ири,Люб,Лид,Его,Ана,Кон,Оле,Бор,Мия,Евг,Ян,Сем,Арс,Яна,Сте,Вла,Лео,Гео,Дар,Све,Роб,Все,Али,Кри,Ари,Вад,Иго,Ден,Пёт,Уль,Ели,Лил,Пол,Вяч,Але,Пав,Над,Дан,Свя,Май,Гор,Иль,Ива,Таи,Рус,Ада,Ант,Еле,Мат,Сер,Тим,Вас,Тат,Зах,Бог,Ксе)})}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">first_name</stringProp>
              </elementProp>
              <elementProp name="last_name" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${__V(${__chooseRandom(Абра,Авде,Агап,Агаф,Агее,Аким,Аксе,Алек,Алех,Алеш,Анан,Андр,Аник,Анис,Анох,Анти,Анто,Арта,Арте,Архи,Аста,Афан,Бабу,Баже,Бала,Бара,Барс,Басо,Безр,Бели,Белк,Бело,Беля,Бере,Бесп,Бесс,Бирю,Блин,Блох,Бобр,Богд,Бого,Болд,Боль,Бонд,Бори,Боро,Боча,Була,Булг,Буро,Быко,Бычк,Вави,Васи,Вдов,Вере,Вешн,Вино,Вишн,Влад,Влас,Волк,Воло,Воро,Высо,Гавр,Галк,Гера,Глад,Глеб,Глух,Глуш,Голи,Голо,Голу,Гонч,Горб,Горд,Горе,Горл,Горо,Горш,Горю,Горя,Грач,Грек,Гриб,Григ,Гриш,Гром,Губа,Гуля,Гуро,Гусе,Гущи,Давы,Дани,Дегт,Деме,Деми,Демь,Дени,Дмит,Добр,Долг,Доро,Дроз,Друж,Дуби,Дубо,Дубр,Дьяк,Евдо,Евсе,Егор,Ежов,Елиз,Елис,Емел,Ерем,Ерма,Ерми,Ермо,Ероф,Ершо,Ефим,Ефре,Жаро,Ждан,Жили,Жуко,Жура,Завь,Зайц,Заха,Звер,Звяг,Зеле,Зими,Зино,Злоб,Золо,Зори,Зото,Зубк,Зубо,Зуев,Зыко,Иван,Игна,Изма,Ильи,Исае,Исак,Каза,Кала,Кали,Калм,Калу,Капу,Кара,Карп,Карт,Каса,Кась,Кире,Кири,Кисе,Клим,Клюе,Княз,Кова,Коже,Кози,Козл,Козы,Коле,Коло,Колп,Коль,Кома,Коми,Конд,Коно,Конс,Копы,Корн,Коро,Корч,Корш,Коса,Кост,Кото,Коче,Коше,Крав,Крас,Круг,Крыл,Крюк,Крюч,Кудр,Кузи,Кузн,Кузь,Куку,Кула,Куле,Кули,Купр,Куро,Лавр,Лаза,Лапи,Лапт,Лапш,Лари,Латы,Лебе,Леви,Леон,Литв,Лоба,Логи,Лопа,Лосе,Луки,Лукь,Лыко,Льво,Люби,Майо,Мака,Маке,Макс,Мала,Мали,Малы,Маль,Марк,Март,Масл,Матв,Медв,Мель,Мерк,Мешк,Меще,Мина,Мини,Миро,Митр,Миха,Михе,Моис,Молч,Морг,Моро,Моск,Мура,Мухи,Наза,Наум,Некр,Нест,Нефе,Неча,Ники,Нико,Нику,Нови,Носк,Носо,Овся,Овчи,Один,Озер,Окул,Олей,Орех,Орло,Осип,Остр,Павл,Пани,Панк,Пано,Пант,Панф,Пара,Парф,Паст,Пахо,Петр,Пету,Пиме,Пиро,Плат,Плот,Позд,Покр,Поли,Поля,Поно,Попо,Пост,Пота,Прок,Прох,Пуга,Рако,Рого,Роди,Рожк,Роза,Рома,Рубц,Руда,Рудн,Румя,Руса,Рыба,Рыжо,Ряби,Рябо,Саве,Сави,Сазо,Саль,Само,Самс,Сафо,Саха,Свеш,Свир,Сева,Седо,Селе,Сели,Семе,Семи,Серг,Сере,Серо,Сидо,Сизо,Симо,Сини,Ситн,Скво,Смир,Снег,Собо,Соко,Соло,Сомо,Соро,Сотн,Софр,Спир,Стар,Степ,Стол,Субб,Суво,Суда,Сурк,Сусл,Суха,Сухо,Сыче,Тара,Тере,Тимо,Тито,Тихо,Ткач,Тока,Толк,Трет,Триф,Трои,Троф,Трош,Тума,Увар,Улья,Усов,Успе,Усти,Утки,Ушак,Фаде,Федо,Фети,Фила,Фили,Фирс,Фоки,Фоми,Фрол,Хари,Хомя,Хохл,Хром,Худя,Царе,Цвет,Чебо,Чере,Черк,Черн,Чесн,Чижо,Чист,Чума,Шапо,Шаро,Швец,Шеве,Шевц,Шест,Шило,Широ,Ширя,Шишк,Шмел,Шуби,Шува,Шуль,Щегл,Щерб,Щуки,Юдин,Яков,Яшин)})}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">last_name</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request By ID" enabled="true">
          <stringProp name="HTTPSampler.path">/user/get/${__V(${__chooseRandom(82e6ea08-c0a2-445a-951d-ca3a5405e8fe,6c69d729-75a5-4762-bced-d6315b829314,c5f8a276-b908-48aa-90dc-73cf231c8850,1722413d-4ed4-4803-a766-f7589166f550,4e623ab2-0b96-4f8f-a52b-37c4efcfbffd,d0790ba6-5334-43a0-8529-196e077bd07d,c5a0ba10-5020-4bb7-bc7a-ac8ad8649941,5343b79b-7a98-49bc-9a1c-f36faa9f7809,5ad15418-d222-4e58-9961-7123c0001412,e34700fb-7554-4e2d-be7a-4acf0d032c68,cf7c38c9-fbae-4ac5-97cd-48c3ab284042,4af47c0c-27c6-4639-b5dc-f45c84bbf42a,2871e6cd-4ff1-4317-9701-333bed5df32a,a45a2266-18fb-4f22-8b4f-9b3f5514af47,acca3f20-8241-4d16-99f1-48dcdf8ea399,46ceb4e4-7aff-4bd2-a6d1-c41d59eca992,afbffafe-90e2-400a-b0b0-e083474874c1,7f41c388-79f2-404d-a891-d71e9ce8c71f,5b3fd102-ec09-445d-8121-3611d4897e36,0fee219e-898c-45be-9758-9f80796de2c0,fa0d1bc1-1d2a-433e-95ce-a7633c2855ea,8821f5a7-44a8-4aff-b477-95e3d4485da3,5bb64b68-ac81-4322-ae44-65acde937c13,d258ae69-3a75-4dd7-a4ec-9b873745ada7,68c510b1-9fcc-4f91-9291-00f14f7ff728,a5ea46cf-f8e5-49ae-8ba2-d6ae84630a7c,33fe026e-fb5a-40da-b4a3-a125db19cafa,669b1b6b-ce7d-4125-b2ff-f3387124aa16,82a7b06f-7c7b-4d47-b65c-f28a41213615,353328b2-8426-4606-858c-e1d4fab9a41f,96702ebf-8d64-4e34-97bb-7c87049f6348,6bcb4ba5-c342-41c7-830a-4a1836ce8f98,0bb5c6ca-feab-4c3a-8157-59f6bd85c9a0,38217938-773f-4cad-b4f9-a6c595d72776,6b5f91bc-e01b-4fa5-8bb1-eddbf0c22c06,ae2511ab-3065-4f99-9293-9581c2c1b584,498fdf75-ddc7-45d3-8f70-0b872d327a78,2a169815-6bd6-4a77-8f68-6d4c95cac548,711b7487-1d22-4018-acad-d11006d8ea37,d3673809-10c2-4510-a75c-9b164d4a5a07,41c36db5-6234-4d2b-a89e-45584189e24e,bc17fa05-bff4-471f-b97f-6197bbd79d6b,dc5615ad-d675-4b6c-a8f2-6e0b3727178a,52da5e14-bcd4-469c-97de-98f2ac88f02c,f9545467-0d62-41a1-a12f-05c6a1231748,12ec9818-d495-4149-b762-9ebaf4760d00,e81a8a5d-0766-4808-853f-8a17c76be00f,ac74c7f7-454b-4900-a2a7-e7066c944e8a,054626c8-f4a5-4f44-8cbb-47122e1330a8,cee00829-672b-42e2-881d-1c14a97eebcb,cc123049-61cf-4a6e-bb1f-0b4c33c3a696,637312ca-4b57-4f52-a0fb-5dc5b4580314,de285689-92e9-4ad8-874d-3dc86f0e5fc4,35e59a0c-065c-48ec-9727-43c6e255a7cb,bcce8241-4471-4fe6-b02f-af0a0b75e117,4ee13f74-0cfd-4783-832e-9b5994c3aad5,c228a0fc-9e95-4696-93f1-417a4a44a784,4f646998-1614-4d4f-a8c9-39ea6a61dc25,5db72e72-fb61-41d8-8570-b10b58c58651,ab99f5f3-2151-4229-9bef-8c622060ca8b,e6c0cc4f-9563-4302-8785-b38254c0187c,a2180947-6ec5-4283-8557-40825b7c9d87,663e1428-350f-43a7-ac71-80dc57c161ea,dd09aefe-b764-4154-a896-fd4b0f0e6722,d7126cc2-6608-43df-82a4-041ab34c3855,8b643a85-a481-4cb9-a1de-59a1581433af,5b0307c0-432c-4e69-a011-73ad7d107f48,cea7b099-71d8-4e50-92d6-07eb87b888b0,25233833-b027-4dff-bf4c-38d12125a44c,fa245571-f1e4-4310-98ab-353a2535360c,1fb5b752-242b-4d18-b8bc-d2bb456b0437,9a1f9adc-df99-4fb5-8d1d-ba55507b2be3,875421cd-f5bc-43b2-9003-58fa9c93d1df,954fce58-c766-4144-8299-67ed93eabdba,9773dd86-8cb0-4539-8c5c-d1cccd2cca69,f0c842b9-84e1-4c40-831e-1481153431ef,5970a077-ec9c-4723-a829-4f71074c1ee8,2aa0fa65-51bf-4313-8173-b2937bba12b4,25f6d9be-c33e-4a49-8a30-d8c672ad32fb,dd41e813-4504-456a-8888-888c504bfcdd,97e488e5-f17a-4fe4-b494-59df8bc602fa,798eca65-6f31-4102-9cfb-e3b77304074c,8761ae2d-607d-4236-82da-69a7b8bce037,9bc5a1fa-7923-4e0e-9fa9-77f374cfca0b,0d472fd5-7216-484c-b2db-bc813be16eed,de319678-7811-4ede-b2a0-e0da962a49b6,ae56c020-45d6-46a7-b734-1e89f7f1ba5a,3e3880b2-27b1-4b4e-9e72-0fa2d65bff6c,6193a153-7a80-49e4-b3da-6904c8b1b952,9e9af179-5340-428b-bddb-1c86f18151ef,bf290f82-20ef-4153-be7b-35f33ef70631,49f0c2ba-0074-46dd-bfc5-972a9413ccba,60c9e93b-d9e8-44f3-bb46-ffd8f4226f27,0b28f4fb-d4c3-402f-b8a0-d9f347d5671c,3792d828-5f15-428e-b1cd-818361d3f02e,93c12b65-a16b-436a-863b-c482f366a610,3cc7309c-dc5e-4aae-a7eb-948c49bff7cd,e7a6a372-645b-4036-a1da-305a69a7a40a,1435ca04-ab7e-4756-8f2c-4e3af3dc111b,eccbbdfc-8ac9-4ce1-b3a7-d36de9574087,26edc20d-5b23-4aee-8000-95e91a006fca,4fe1bc8e-f684-416e-b0b5-d8d2998cdd48,fbc493ed-cbd0-4cdf-b3bd-97e88568d7db,3be2d9bc-1a4c-48b8-b2ae-9c48c5698fd2,a8527ce9-e70b-4c8c-b53e-230f0f98f740,11df615c-a11a-409f-8818-88a52688af98,b1b3a808-2b99-41b3-a7ed-6459e8c3a772,8aac63d8-edc7-49bc-9310-065e7c662c73,43a2db7f-005a-4d9c-a9d4-1dca9bab8ae6,f8f9e56b-3dca-4e49-b2b4-7a93240ed454,337ffb45-96a0-41c7-adfc-1d1a3b0835ec,1bea8927-6703-42be-bf50-b1555f830a92,78578d4a-c85c-44ce-ba27-1e9e39057236,b28e324f-7e0b-4b16-968b-c6bf4eba8e88,2a4ee9d2-3e12-4cc6-816c-5b60b8b634a2,2b378d85-80ad-4276-8951-35c28f7b5db4,59be3a0a-bfc1-443e-b38f-29baa7233587,2d3b1a97-878f-476b-a3f6-faf74bf45654,1d336b2a-1ea2-4d1d-9ba2-638c5e7785e0,30b0e987-47db-4751-a7c0-052f03d0630e,a75e9995-9719-4698-a5a7-f547b46a3f09,65dacbfe-ec13-4ef4-9384-bd90c1039769,323c3eb8-e928-4dbb-a714-bf41e3b88f20,382fa427-6bbc-467d-8d03-6195255c5cff,5e04ef9e-1e0b-4fc6-be94-c3f255bf1902,d596e0b5-1093-4204-80f8-b1098dd9cf70,aa154a0a-62d1-4570-bdda-063f252327dd,5c9e0e82-d663-455e-83dc-9ac73471a418,4a257c84-a7f7-4d56-8be2-c7fc8b277bf4,313dd054-021f-4baa-a455-582c96c4882b,e234237e-64c7-4d89-bcb6-a09951dbff89,40f3600f-74e5-42ba-9b93-2d200b0d1776,9a00f71c-8954-453e-b552-b993e48dcebc,f847f5a0-a60b-461a-8b66-171895caa7a3,d8708a80-0cc0-4ecc-b5cd-a04c6e194ce5,b128adf5-c086-4ae2-8cd4-b38d06c9f9e8,0257545f-3688-46ab-9731-7068de3fdceb,5533e9bd-6970-409c-a3e8-c0b6cbcb8acb,6c65dfdc-62a7-41e0-8541-2291207dca59,10460d19-2b44-4d97-b5d1-6a36dbc8216c,8e5d833a-de84-473c-9f7c-046bf1484005,27892ad3-175e-47c7-b78c-c0e2795d24ee,121142ab-e656-48b0-b37d-1ab4781846b9,8955916f-7d40-47dd-a1e3-e4cc2c903134,e3aa20dd-6fa0-4465-ab66-03b4e63fb97b,6c1215fb-8dda-4071-a105-ea60df4a98f2,eb88fbe4-2dc5-4693-9ff3-710e5ebea065,61cfbd51-52da-4853-b265-21bc4268b123,4934c569-7799-4134-b59a-cc1cfa9a88cf,fabcb340-354a-46b4-9d8f-e69b7639078f,fb05c9cb-591b-481c-881b-fd15d4bf2531,4c1b8bf2-fd6f-4a14-ba38-40fb81900a59,07e9d1a4-2481-48eb-99de-55f4cb0c6bf8,0f14da6a-b0c6-4f89-8128-ddb9537b1f38,94e8f2e9-bc15-41e2-a3d0-aeaf9b062310,80e39353-7608-4164-a84e-e30b6c0c0543,10d7ed59-03be-40c9-abbb-e9b6e0065c56,489a2a86-baaf-4536-89c9-934d679275a0,f3e93610-11ad-413b-b06b-e05e5649d2dd,2dfd8c56-7cee-406a-adb3-62c9d2801d4d,47b583e8-0ab7-406e-b674-4b51361a79e0,c70be2c6-ee43-4984-8e70-553a7c52a167,a7c67592-96af-4e93-8f85-0e0b1e70cca2,a6df43e9-c780-4559-8cf3-8360f7e26089,b3e274c6-f66f-4675-9b5d-7ee523f326cd,a502a6b7-fc16-4626-b6e6-0261865b2c2e,d9b3ebd8-b50b-4bf9-af00-3a0fde5cb2c0,734ae294-4aae-4024-a706-4587e47af3da,f8057bc1-69ac-4fbb-96b8-a22418b096da,056297ae-8452-42c1-a3f6-42ca644fef2f,31d04714-0f58-4542-aaa0-465749725a33,4da30727-0989-4d7e-8968-2bb11e9c2da3,22333e39-292a-4d87-aa4b-dc78b941ddc8,9c0b7f5b-7962-429b-9381-3bea9f56dace,1157ae5c-a9bc-413a-a78a-f725a372f7bb,d43920c3-39cd-4a3e-bbbc-616a78e09f39,f49c34f2-3285-423b-8201-67d2dc09a5b5,cd88c50b-af4b-4c40-bb4f-7da4f096e627,4aef4282-8316-4eb5-a7c6-38037e0b4126,41fb8542-c958-46fc-9252-e0ac55f023d8,86a55b04-17f5-43ba-937c-92339c66777a,5ff5d8f3-26ec-4d1b-87b2-97ed50385b20,4942b279-49ef-4e45-8eec-0bce2caa6764,6bf659aa-3be8-4295-9a53-89ba60d7408c,d2e4471b-6ad5-46a1-9d21-93f41c75c4f9,d55c27c0-b043-405a-b695-d5e8ce762625,678d8a0d-dda2-4d67-a06b-e0dd6aba0f33,9ac9a5fc-4d04-4c1b-a1b7-aaa0ebdb134c,87120638-92ce-4c3c-93ce-1f399e176f32,b097dc3d-7596-4760-956c-0fd1662ba165,5a1eeaf5-9ac7-43f7-bd48-6707d7094ad0,a9e79030-14a7-4f6d-b35c-f192a2a24414,33125fb3-41e6-4ae4-9555-7fc53c7c9973,7e1ec5ee-7ffb-4383-a03f-25aba48d0a61,08322965-3c58-4df0-82ed-49a74a71cad7,d1e0ab19-cbae-4cf4-86e3-2bad5cabd0bd,8da656c2-5c21-47bb-98e6-abbf8ae63c32,e53dcdec-f227-425f-8bea-9ed9acebb856,10daed6b-861e-4c1b-aa7c-56e37b016502,deb7f8df-7c0b-431c-8f4a-4bd3d40dd5bb,5f921736-6d6d-447d-aba3-0ff5311478d8,bcfe7cd5-c4a9-4646-bef0-289f07a9baaf,48beb1b5-28e8-491c-afe3-15f44aaa3889,86149c15-ae8a-4df7-b3b8-06fd7b39ab16,0680b450-fb89-4e93-9487-a42e5d4b998b,f973203a-e77d-4f26-9399-7d4b46545582,09f1c726-b941-41b8-be6c-3b5639bfa9ba,e527dfff-098c-4ef2-bcbb-5b3d6caa3206,69d4917d-f324-4121-af63-65872504fb8b,2dbeb668-0315-445c-a62d-9074aa2d9378,30442884-8a47-493f-8eda-e5669316ce28,f9392803-86e9-4c54-a03d-3781e3c824b1,4d0d17e6-c9a7-4358-b941-9588e77b803c,e6bdfc64-3fbb-4269-8390-8d7e01239edf,67d8b0e4-496d-4d6b-8c79-d1a9be3c944e,1cecc0b3-de2d-4a81-a527-59648c7c9911,24040b23-595f-49e0-867a-9d1873f8b2d0,6aa1e28f-3951-45a3-8f24-ccbddf5109b5,5f7dc5ef-fc47-41cb-b81a-0c05f4ad0f0d,62375859-19bd-4c54-9ddf-67ef1e345abc,0d8ef287-4f64-48f0-8f6f-3ffe6b99cc9b,ff9f8474-a8fc-4fcb-b0ba-ded95ce62d36,23409358-cb9d-4b5f-baff-cd0c481222c9,f2037b5f-6289-43e1-a56e-752c1283c474,88690a72-50e4-41f6-8f73-c4685eb18273,542b5aff-dd70-4abb-8761-1568006acd38,a67023f9-c1c3-4694-92ed-8c7785b9b584,800e6f7c-3ef7-46cd-93ae-268e8452ccc8,7676ee2e-9d5a-48d9-97f9-4e452403fed3,edc0734a-41a9-481b-99fa-54a1596033fb,9a5a86e8-8a6e-4835-aa39-c4b475778613,4b3d4090-d950-4625-b83d-a4c8825724f2,1417b31e-0377-4796-8149-4194fc53679a,d26dcb83-e2c4-4b8e-b370-03dcc4485758,8b81edd0-f0d6-4a74-847d-64247e78ff51,24952aba-084f-4dec-b48c-b24119b33305,caa16677-30b3-4c0e-a13c-54c5441e2899,764c7307-97f4-4865-af88-f9705f9664b4,bb2d8faa-ef6f-4248-ba8c-1dc3ddd41ddb,406195f6-9246-42ab-b1af-cb59d333ab26,5bfeba3e-048f-459d-b5ed-6404f52d126b,02d756d5-6065-403a-8260-0b2a6aded844,4c15022f-4210-452c-bfd9-292a6a91bda9,fec5d8f8-87a4-4ac4-b1a9-75e7bea2d536,eb915552-b085-4e6f-9650-686979a74755,1d7cf573-818d-45cf-a627-eaeffe8b85da,91758cf1-47bd-47fd-b89f-e5eb5f1fb3f8,e6a8e6f9-ce88-461b-8524-2699f7e90561,c067eb0b-2f55-423f-bcc5-32ae9496578a,2c820391-d815-45e1-b51c-a868af272280,f51f27ad-5f19-4f31-a3b3-489d4be188ea,936918d8-a1e5-47e6-9f82-f79298df2898,1b78ff19-f047-4b19-86a2-4b7828f2f78e,6f79a779-360f-4a8c-9feb-9e8105eac37f,0280dc35-f589-415d-a3a7-c984ff0ff4d3,9750002f-3379-4422-8b80-0a65de8aa639,75377582-03f7-48c2-8c2e-1eaaa5cee38e,092792f1-be4d-48ad-9b44-2beddaf77394,247ad0db-64dd-4065-9811-e129facbfcfb,95283cbd-6f86-478f-a706-17950fa6bbcb,3b666bfa-9174-4dc9-94db-49dbc18920a0,56e80847-cb36-4287-ba34-f149b2d4c105,be85510b-60d0-447e-912c-22dc9096360a,58e722ff-e693-4913-886c-3cb14e773f6c,8691f8bc-7363-453f-859e-de3e8dcb9ec7,815ca9dd-df54-49aa-8722-cde3fd7a9cb4,51100193-eaee-4620-84ef-2d15c04da55d,50a566d2-f1a5-4435-82eb-92f499e4aa0f,65d1465f-49c6-4913-a5ae-1275567e3e8b,2a9bf34e-73d7-4713-b64b-e51f09d3a28f,a58744e3-2896-4ff3-97e1-3091de6caae8,24693aac-6ef6-4e51-a576-5e62643e411a,1335a907-95c0-4e69-8367-f9c009b1fa6a,6d4819af-5cba-410f-822d-4390cd75e5d5,ce95edc4-c827-4dcd-84d1-3e471aff7292,1cceb72b-8c82-407f-9cff-5dedfd118bb1,a0ca9889-eb41-4b0e-8d76-824eb141e038,2d51b3a7-ecb8-4ce7-a47f-7d7777f7da73,efc2daad-8ec9-4809-b6c7-c5d5dcc7c50e,a73fe774-3d5d-47c4-a34a-1736193cec42,75242317-e3e4-4ec6-935d-205b2a4bc03d,cbe76fee-edb1-479b-aeb2-7700b77cf3ac,e0180370-48ce-428d-9d41-86098b7a8910,b15a1ba2-2403-4195-bd6e-ae601af1a948,2b6151f6-5725-4a2f-8b33-a7d73d9f7596,69ec3166-f6ff-47a7-97a3-cab1120ad372,551a59f7-7ebc-4556-94e2-90bd8dc5ba84,26a42191-d90c-43ca-811a-4e13068436eb,2e035a4a-1171-46bd-9cc8-c31648b1d3e7,3b1a16f5-fac9-43ac-b4c6-92f91eee2dd0,3f888fa1-d0de-40ea-ab7e-1fe43e9e1dc9,b6b9de66-00fc-4a3d-87c1-fd4a4da6e27b,489dd91a-438f-430a-9315-9673ee4fb51a,66334255-57b4-4f84-9c0c-0f414869a886,20bd9ef0-e643-4c99-99c1-d55747cc9661,17289d12-02db-4db8-b4c6-7042fb9cca7a,b4a419c3-f024-46db-8bd4-e054af6767aa,2443163f-49d6-43bb-8bd7-d608247b95e7,a3632055-7a56-4a47-a598-3fc22fca42a9,83cff704-8fab-499e-abc5-914623b10b0a,911973fd-fb61-463c-a4a7-c26cb6c190b4,ea0045bf-4dd8-4903-ba68-da746721e0d1,c741314e-5a6e-4d39-a9ce-0a970b6fae65,05d0b9f5-fb14-4562-9f0b-8ca4a8392fda,f72a9134-f11b-4ab3-b4ad-e7a20e5cf698,1dd8a52c-b577-4e3c-8abb-3c238d27d25d,3e02acbe-4f3d-4f38-acb8-3060ced052f6,c8a56c7f-d14b-45e0-80e6-6ac89c2f4037,09ce9a15-9ed0-4192-8dad-6e71aea2cf42,84675f8b-9eb0-4c2d-8b63-c9c1b60d3b49,8cafe9a9-4c5b-4d33-a2d1-0e99745d3c09,a592c370-f059-4033-85fe-5528d09ecb85,2e4cc1e5-4658-4e1d-a015-cc281460bc5e,8fe60b35-64ca-42ea-8dd4-b3ffa9d3c7ed,3a4a8643-a6d9-4425-8129-6523124b6425,065c7f97-38df-4269-b1fc-e15c4db2ee0f,0210d6fc-4805-4549-9886-b2f210db9dcf,adbc171c-1db1-4f59-8d56-d27e769533d5,b80d0124-1a8d-49d2-a8fa-24a64d5055aa,9754f54f-bc09-4df7-bb49-7c87527f8c1b,413819de-d203-429b-8c30-5951dc18e182,2d47037c-7c40-4242-a350-81303142123f,354515bf-cade-4e42-a259-b4d4d70a9ed9,74c18fc3-9597-4a2a-b632-e72086ac7401,cfb6b4bb-2b54-4b1c-a533-238681708e5b,662014bf-db24-4b0c-bff7-f0a0a5c8aa9b,e8e9dd0c-f935-4562-be1a-44ed3f579c38,4ff3c62f-9666-4b5b-9c52-645c2d9e13a2,fd6d9a13-94c2-44e0-a1fb-2f94336c5469,09289219-df3e-49e8-be59-e2a05c6ee606,d8a403e5-2420-4ecc-ace6-db73d164bb54,e51e1653-720d-4b59-91bc-d76c67e0b076,78074bbc-b4ea-446f-aa6c-1ae7db3a361b,efca949d-de7a-4025-aa85-7c7c83bf22cf,4c66de23-cce2-4d62-abcb-826324490fef,ee2cfa2e-30fc-4b7b-ab93-1d14dec2dd56,2e76b733-8158-4407-9232-be29b3ebb993,0a3b00f7-0cb1-43da-a985-1f721b73e920,937f025d-2119-4237-9c74-b69e6f350b3d,6b6cd92c-0294-48e8-b5c7-d407be56c834,a04f6879-2668-48f0-a74b-6d913728a0ad,bbb4212a-2377-465b-8714-50991a6c2bf8,ab557940-26b8-4018-bbde-2986c5aa5d4d,2532ff22-8c31-455a-93cd-e15c65eee1b3,769bff09-e798-4411-8ed0-fb74a9f89795,bdf8145a-a6f0-4758-85b1-f0cf6c8c4729,8221eb5b-c877-40da-a90d-1a527a43b336,6e7efe9d-d8f5-47ae-a1c9-75db246e47ed,8f45563d-467f-4954-8224-ce14eda5a473,beda2013-32e8-462d-baef-5fbbbc8c1c09,e820f528-20a1-4411-b37d-86fe2c11bd77,7334feb4-76d8-4b9d-9e46-65fc9b0e8042,9ddb336e-b095-4572-be48-4ffc080f8ab0,610bf14b-2207-4279-ae04-1f00fa50cea0,8422581e-e06e-4e20-9336-e3124b7a47cd,be194505-6dc4-4e75-9adb-25db72bacdf2,b9548f93-5e7f-4dd2-b58c-ca9e8c6bb78a,fc278d6e-3b05-48e9-b50a-11d84515bfc0,1020fa33-7b7b-4e14-83cd-006fd1b7e78f,5efc99e7-a4c1-42b5-9924-d8ee16e7935f,dd734dfd-1338-419f-bc55-31368b559843,3971f6e2-df64-457e-9fb5-4f1bb7e469b7,723cd3e7-622f-488b-9cbb-76713cae9891,c525ba35-a6c2-4219-a06c-c77fa6df0af8,704241b0-9890-43ac-a847-92d9ff89bf83,7a5aed5e-dc59-41cd-8dcf-739627121bd5,af1604b0-a2bb-4770-b01f-da4c585f551b,094f4a7f-b90e-4fea-9396-36c105ec0bd6,c1da256b-3501-4586-92b6-dc097d1e3d5b,54970455-4cd1-4d50-bf3d-5e2bc0795dbd,d0221d4b-cb90-4623-82ea-d8dfe534aaed,5347aa2d-a5f3-4c1b-99a8-33e2c53281a4,a2f08ca5-a87f-42a7-bc45-ca34f2e6eb56,afe3c66a-1037-4c99-a8ee-e66cb2a7856f,7db95187-30ec-4dc4-91b7-6a2aef1bcddf,7782622e-b18e-435f-a419-ffb6bcb432bb,abbb9787-9b4e-4568-af95-a4480f51190a,f9f39029-d199-4bdc-ab84-5d6f341b43ed,fdd2a630-1bc6-4910-8109-2e1331eede6c,aa9b22c9-ca6c-4262-af87-a54ee6680336,57f32742-f464-4768-b751-2af052ea8f1b,b41fc110-3ac8-4fd0-844f-34d0c2de0de1,1b9f271d-70d8-44f2-b327-319fb87aaecb,8147c428-1ca2-4fac-b49e-228f84b61b1c,088feaf3-caa7-4b82-9102-9bd3875e47f7,ef6e380a-49bf-4247-b709-c2ed75d95ab5,c96956b5-250d-4bd4-a648-399e7b0b6318,e99b97fe-8b78-4b2f-bff2-a04a79a272d3,e91be4b1-2095-4d0a-8c1a-6f246b65e3f2,8daab958-e183-4f4b-ae5e-3c28e9c2cf51,7aebf062-1a9c-4359-8c1a-88a7517b5e7d,30c6043b-3608-4b05-bf26-c5f4fabc7d15,af74fe80-2d63-4ab6-b251-298665017677,a3223f07-490a-4d68-9854-9f14a65c8bc3,60659202-1d40-4b73-9775-8ee80516045e,b89ca5da-5435-48c2-a382-6b248270fbdc,deddb2a2-38b8-4fa3-b20e-86510b165d38,ead12354-1110-41ae-a69a-23ef59c2b5b5,33541c20-deff-44d1-bca0-2dda52945947,cdbe4e6f-c63e-40e3-b694-8bf1fe95cffa,65d07dd7-aaf9-4608-afad-6fc2b36903e1,28a56726-fc37-42a1-b5c4-5028bef74057,2107b9bf-59e2-4aea-9c30-5b4f92ec19ad,396d4648-bf5e-41d7-845f-246430045d23,0bc00ec9-803e-49bb-91d2-122dc59fe2ac,5986ef05-d745-4ffa-8b11-269817240428,2684f6c8-6a7c-41d7-b0e3-221bda058a18,332ba401-f89c-4722-b564-a2fe5d136f08,94994ea0-0086-46a4-9eaf-c925d4391579,d36107cc-25df-4904-a1b1-c703b6553995,95ce8f89-0c10-4874-9db6-574ed07d944f,5edd52cf-5c46-433e-98fc-1a0862030285,16d7d154-49c4-4d15-91fe-855f72876cd0,5b9cfc74-d8f5-47e5-9980-d75457b3268c,40ca6f23-eb59-40fc-a321-2774101036fc,a1ada8d1-14aa-4170-9f68-8cea18d37ace,962314a6-ac16-44c3-bc7f-8b3f5eb51767,681fb791-5fa5-4239-b09c-e04d412a95b3,8bc7c54b-9c5d-405f-b47b-1451005ad315,0bb69ac0-27fc-4c5a-9e73-ba51e861fa3b,d55431a9-62b7-44ca-93a5-c6ab6bd17403,b50fdc17-35cc-4b6b-9214-b4005b187a29,c90e33aa-c31b-4c23-ab80-d7b1b3b5f16f,99833e6f-a686-40c5-bfeb-f8ef34df6edc,6f5c9887-9d97-4eb5-bd09-08baa6ff15c0,4f208fa9-f198-43d2-b741-aa873549fd3b,ca22758b-037c-4c9b-931b-6f0027b72d59,35009b81-753d-487b-ad4d-1bf084a23154,a4e9e84a-a5e3-419e-b342-fe894040e01f,e6f1779d-d3fb-4df8-afa0-06813d6f7fda,84daa1a0-03b6-42a2-8860-ef8065d6f976,c3a17fe4-df6c-4bec-8bf6-1f3656e9ec85,0f96784a-5c08-4c90-8001-a97bfb0fc785,a145b74f-338c-4139-b468-cb94c5e27f9a,0fe12d1d-d137-4631-a603-7bc1235f67cf,d6ecb03c-3cfe-4b1a-971d-76fc6723d687,615a992e-bed7-4797-953e-b77c3dd30d23,5642ba47-ca96-427e-9b73-4308cc5361ec,5b4348e4-4828-4772-a1a4-19a056750dc1,a671c7ce-a678-415b-892d-2337cc7522fd,7569afa6-5861-4d3e-ae71-e8884619b6ff,e24867af-d9cd-488d-958f-ea326e954245,eb07af43-3567-4f97-879d-bb1be5d75bb4,0d4b255b-4058-4b82-803c-a5e1ae90a375,338e7860-47b1-4095-b9cc-88c8fb8f2483,1c9cd525-e9e8-49b1-88e5-d30bfb4f167c,3d295f0b-8125-4df1-9066-8ee9934df6ff,8b41be48-61ef-4b7b-b857-c101e8b813d1,3fdd5c4d-9626-4aa2-8a42-67cb402a0dac,021edebc-678a-4a17-8821-3bf0db377083,a409921c-3877-4934-a3ed-9633279bdb95,fe7dbe71-80ba-4a4c-a6cd-e307cb99c4a8,640a3a25-2df8-44c2-8b8b-eeffcd8c63b3,40444df5-0aed-4cf8-9630-b8335a8888cb,56d62880-5549-4d4f-a967-0a4a72adb13d,887d760f-3504-4fc7-9a33-72634ce7c6f6,f4cb435d-8fac-403a-aea4-f09bcd098750,b250d4e1-cfcd-4075-88df-348504e97582,f0268543-8309-472e-a33d-0a6cb4206ca0,c30e5c24-d6b8-425b-a833-7505e420b154,4e8529ce-6acc-412c-861b-3422343b0116,7adda9f4-1834-4b70-849a-38daa2f07b16,f501b605-9a98-4d2e-a5f1-7038cc077ca4,764b28c4-95bc-45c2-8b2c-c110ca6784fb,afa5742f-a2d0-4233-8cc0-6e7d4f17afd7,45de0f42-2bd1-43e9-a3dc-2cd243ea1843,1e7dd325-4e1c-4b65-8522-837bf0971dd0,44a12479-ce42-4672-88aa-d9f5f98a05cf,01431792-b490-4292-938e-6f2de291df28,52e65e2e-1287-42d3-bf5c-1ef6f36749ce,d3540201-3b69-4e29-a781-e6a65a5dcd18,b057007c-deac-4669-9c26-aa8e9f1d86d9,18aeb154-dbd3-4b06-af76-4dc08bd5c667,7a497eb2-4c17-4168-a2d6-b4b854629b9f,d7789c3e-9ae3-48ed-abed-67f80f8d264b,e0b18075-e678-4fc8-bf4c-8ba3a7cbbb31,9a25ac65-b6f6-4b87-969c-7ff5bad1a874,864d8254-0d36-4400-9fa9-cef0631e76dd,23c09f5c-77b3-495f-8e81-b26fde3709e8,bc0427cd-b5da-4d14-93ef-82effd2a4d98,ee5b9dc5-79c3-4045-ab91-827696071e36,ccdd0c01-b673-4522-9028-54666d384215,7984813b-7db5-4f05-9520-6291160e07f0,6175b7d5-a269-4601-ac4f-fff4b370e83b,a885aab8-876b-4c38-b737-bb3e9ab9cdb6,0173de01-ef17-456a-aca6-dc281bd3c25d,4f54e781-6e69-4477-ad59-5b357f4f1e79,3bfe47ef-cf89-4bec-8d64-f23fe701836b,21cd5f48-339d-47ed-9cca-ae963e51b6f3,1a38effe-4913-4641-a2e1-01382e4179b0,75c30a11-128c-48be-98ce-5ee4458ca33b,d491db82-5937-45f6-9236-a758dc0f8cc4,991f197e-04a8-4c62-a0e7-aa85a1b0e649,53735944-0fee-4503-af3a-601c3794d3cf,ac3223fa-ac0f-4b96-894c-333ae1b930b0,62739f78-47d0-44af-9ccf-5edc7c884b02,2c29e3ee-c818-4673-a06f-bfd8ccb81052,c5f5fca5-7328-49b1-a81b-94f718218e37,ae8e1e5f-42c8-418a-adfb-10d52c797605,85943017-009b-4238-8c10-7eb5a7baf8dd)})}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <com.github.johrstrom.listener.PrometheusListener guiclass="com.github.johrstrom.listener.gui.PrometheusListenerGui" testclass="com.github.johrstrom.listener.PrometheusListener" testname="Main prometheus listener" enabled="true">
          <collectionProp name="prometheus.collector_definitions">
            <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
              <stringProp name="collector.help">the response time for a jsr223 sampler</stringProp>
              <stringProp name="collector.metric_name">jsr223_rt_as_hist</stringProp>
              <stringProp name="collector.type">HISTOGRAM</stringProp>
              <collectionProp name="collector.labels">
                <stringProp name="102727412">label</stringProp>
              </collectionProp>
              <stringProp name="collector.quantiles_or_buckets">100,500,1000,3000</stringProp>
              <stringProp name="listener.collector.listen_to">samples</stringProp>
              <stringProp name="listener.collector.measuring">ResponseTime</stringProp>
            </elementProp>
            <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
              <stringProp name="collector.help">the response time for a jsr223 sampler</stringProp>
              <stringProp name="collector.metric_name">jsr223_rt_as_summary</stringProp>
              <stringProp name="collector.type">SUMMARY</stringProp>
              <collectionProp name="collector.labels">
                <stringProp name="50511102">category</stringProp>
                <stringProp name="102727412">label</stringProp>
                <stringProp name="3059181">code</stringProp>
              </collectionProp>
              <stringProp name="collector.quantiles_or_buckets">0.75,0.5|0.95,0.1|0.99,0.01</stringProp>
              <stringProp name="listener.collector.measuring">ResponseTime</stringProp>
            </elementProp>
            <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
              <stringProp name="collector.help">the total number of samplers</stringProp>
              <stringProp name="collector.metric_name">jsr223_count_total</stringProp>
              <stringProp name="collector.type">COUNTER</stringProp>
              <collectionProp name="collector.labels">
                <stringProp name="102727412">label</stringProp>
              </collectionProp>
              <stringProp name="listener.collector.measuring">CountTotal</stringProp>
            </elementProp>
            <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
              <stringProp name="collector.help">the total number of successful samplers</stringProp>
              <stringProp name="collector.metric_name">jsr223_success_total</stringProp>
              <stringProp name="collector.type">COUNTER</stringProp>
              <collectionProp name="collector.labels">
                <stringProp name="102727412">label</stringProp>
              </collectionProp>
              <stringProp name="listener.collector.measuring">SuccessTotal</stringProp>
            </elementProp>
            <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
              <stringProp name="collector.help">the response size for a jsr223 sampler</stringProp>
              <stringProp name="collector.metric_name">jsr223_rsize_as_hist</stringProp>
              <stringProp name="collector.type">HISTOGRAM</stringProp>
              <collectionProp name="collector.labels"/>
              <stringProp name="collector.quantiles_or_buckets">100,500,1000,3000</stringProp>
              <stringProp name="listener.collector.measuring">ResponseSize</stringProp>
            </elementProp>
            <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
              <stringProp name="collector.help">success ratio of the can_fail_sampler</stringProp>
              <stringProp name="collector.metric_name">jsr223_can_fail</stringProp>
              <stringProp name="collector.type">SUCCESS_RATIO</stringProp>
              <collectionProp name="collector.labels"/>
              <stringProp name="listener.collector.measuring">SuccessRatio</stringProp>
            </elementProp>
            <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
              <stringProp name="collector.help">the latency (ttfb) for a jsr223 sampler</stringProp>
              <stringProp name="collector.metric_name">jsr223_latency_as_hist</stringProp>
              <stringProp name="collector.type">HISTOGRAM</stringProp>
              <collectionProp name="collector.labels">
                <stringProp name="102727412">label</stringProp>
              </collectionProp>
              <stringProp name="collector.quantiles_or_buckets">100,500,1000,3000</stringProp>
              <stringProp name="listener.collector.measuring">Latency</stringProp>
            </elementProp>
            <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
              <stringProp name="collector.help">the idle time for a jsr223 sampler</stringProp>
              <stringProp name="collector.metric_name">jsr223_idle_time</stringProp>
              <stringProp name="collector.type">SUMMARY</stringProp>
              <collectionProp name="collector.labels"/>
              <stringProp name="collector.quantiles_or_buckets">0.75,0.5|0.95,0.1|0.99,0.01</stringProp>
              <stringProp name="listener.collector.measuring">IdleTime</stringProp>
            </elementProp>
            <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
              <stringProp name="collector.help">default help string</stringProp>
              <stringProp name="collector.metric_name">jsr223_assertions</stringProp>
              <stringProp name="collector.type">SUCCESS_RATIO</stringProp>
              <collectionProp name="collector.labels">
                <stringProp name="102727412">label</stringProp>
              </collectionProp>
              <stringProp name="listener.collector.measuring">SuccessRatio</stringProp>
              <stringProp name="listener.collector.listen_to">assertions</stringProp>
            </elementProp>
          </collectionProp>
          <stringProp name="TestPlan.comments">This listener &quot;measures&quot; everything, sometimes in summaries, sometimes in histograms.</stringProp>
        </com.github.johrstrom.listener.PrometheusListener>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>